# IsAutomatic Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IViewSheetSet..::..IsAutomatic Property
IViewSheetSet Interface See Also
---
Automatic order or manual order.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
bool IsAutomatic { get; set; }
```

Visual Basic
---
```text
Property IsAutomatic As Boolean
	Get
	Set
```

Visual C++
---
```text
property bool IsAutomatic {
	bool get ();
	void set (bool value);
}
```

# See Also
IViewSheetSet Interface
Autodesk.Revit.DB Namespace